gallery-api-backend/app/controllers/api/v1/comments_controller.rb

INSERT INTO "comments" ("picture_id", "created_at", "updated_at", "body") VALUES ($1, $2, $3, $4) RETURNING "id"  [["picture_id", 1], ["created_at", "2020-07-29 00:25:16.622212"], ["updated_at", "2020-07-29 00:25:16.622212"], ["body", "sdasd"]]
---
    def create
        @comment = Comment.new(comment_params);
        if (@comment.save)

SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 8]]
---
    def destroy
        @comment = Comment.find_by(id: params[:id])

        if @comment.destroy