gallery-api-backend/app/controllers/api/v1/pictures_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20)
SELECT "pictures".* FROM "pictures"
---
    def index
        # sort by likes
        @pictures = Picture.includes('comments').all

INSERT INTO "pictures" ("title", "like", "imageUrl", "favorite", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @pictures = Picture.create!(picture_params)

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "favorite" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["favorite", true], ["updated_at", "2020-07-29 01:09:29.589993"], ["id", 5]]
---
    def update
        # byebug
        @picture = Picture.find(params[:id])
        @picture.update!(picture_params)